app/views/comments/_comment.html.erb

    <h6 class="comment-name"><%= @comment.user.username %></h6>
    <span class="comment-time">on <%= @comment.created_at.strftime("%Y-%m-%d") %></span>
---
INSERT INTO "comments" ("content", "user_id", "proof_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "New comment"], ["user_id", 1], ["proof_id", 2], ["created_at", "2018-06-22 02:34:19.482206"], ["updated_at", "2018-06-22 02:34:19.482206"]]