app/views/problems/index.html.erb

SELECT "problems".* FROM "problems"
---

              <span class="problem-comment"><i class="glyphicon glyphicon-user mr-5"></i> <span id="problem-<%=problem.id%>-followers"><%= pluralize(problem.followers.count, "Follower") %></span></span>