app/views/problems/show.html.erb

SELECT "topics".* FROM "topics" INNER JOIN "problem_topics" ON "topics"."id" = "problem_topics"."topic_id" WHERE "problem_topics"."problem_id" = ?  [["problem_id", 1]]
---
            <ul class="tag-list mt-20">
              <% @problem.topics.each do |topic| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
          <%= render partial: "problems/problem_author_item", locals: { problem: @problem, action_date: @problem.created_at, action: "Asked", user: @problem.user } %>
          <%= render partial: "problems/problem_author_item", locals: { problem: @problem, action_date: @problem.versions.last.created_at, action: "Edited", user: @problem.versions.first.user} if @problem.versions.count > 1 and @problem.versions.first.user != @problem.user %>

SELECT "proofs".* FROM "proofs" WHERE "proofs"."problem_id" = ?  [["problem_id", 4]]
SELECT COUNT(*) FROM "proofs" WHERE "proofs"."problem_id" = ?  [["problem_id", 4]]
---
          <div class="col-md-12 blog-post-comments proofs-section pa-30">
            <% if @problem.proofs.count > 0 %>