app/views/proofs/edit.js.erb

SELECT  "proofs".* FROM "proofs" WHERE "proofs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
<% if !@proof.nil? %>
  $('#proof-<%=@proof.id%>').find('.proof-remove').css('display', 'none');