app/controllers/comments_controller.rb

SELECT  "proofs".* FROM "proofs" WHERE "proofs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def new
    @comment = Comment.new
    @proof = Proof.find(params[:proof_id])

INSERT INTO "comments" ("content", "user_id", "proof_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "New comment"], ["user_id", 1], ["proof_id", 2], ["created_at", "2018-06-21 16:42:50.308174"], ["updated_at", "2018-06-21 16:42:50.308174"]]
SELECT  "proofs".* FROM "proofs" WHERE "proofs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    respond_to do |format|
      if @comment.save
        # Notify people who have commented on the proof
        ((@comment.proof.comments.map{ |comment| comment.user }).uniq - [current_user, @comment.proof.user]).each do |commenter|

UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "TYhis is an updated comment"], ["updated_at", "2018-06-22 02:45:23.658528"], ["id", 2]]
---
  def update
    @comment.update_attributes(comment_params)

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 4]]
---
  def destroy
    @problem = @comment.proof.problem
    @comment.destroy