app/controllers/images_controller.rb

  def destroy
    @image.destroy
---
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 8]]

  def create
    @image = Image.new(image_params)
    @image.user_id = current_user.id

    respond_to do |format|
      if @image.save
---
INSERT INTO "images" ("image_data", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image_data", "1.jpg"], ["user_id", 1], ["created_at", "2018-06-17 11:20:48.047449"], ["updated_at", "2018-06-17 11:20:48.047449"]]