app/controllers/problems_controller.rb

  def index
    @problems = Problem.all
---
SELECT "problems".* FROM "problems"

  def create
    @problem = Problem.new(problem_params)
    @problem.user_id = current_user.id
    tags = problem_tags_params["tags"]
    tagsArray = tags.split(",")
    respond_to do |format|
        exception = @problem.save_with_topics(tagsArray)[:exception]
---
INSERT INTO "problems" ("content", "title", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "wrferfrf"], ["title", "edfr33f"], ["created_at", "2018-06-16 03:10:42.182857"], ["updated_at", "2018-06-16 03:10:42.182857"], ["user_id", 1]]

    def set_problem
      @problem = Problem.find(params[:id])
---
SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]