app/controllers/proofs_controller.rb

  def index
    @proofs = Proof.all
---
SELECT "proofs".* FROM "proofs"

  def create
    @proof = Proof.new(proof_params)
    @problem = Problem.find(@proof.problem_id)
    @proof.problem_id = @problem.id
    @proof.user_id = current_user.id

    respond_to do |format|
      if @proof.save
---
SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "proofs".* FROM "proofs" WHERE "proofs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "proofs" ("content", "user_id", "problem_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    @proof.update_attributes(proof_params)
    @problem = Problem.find(@proof.problem_id)
---
UPDATE "proofs" SET "content" = ?, "updated_at" = ? WHERE "proofs"."id" = ?
SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def destroy
    @problem = @proof.problem
    @proof.destroy
---
DELETE FROM "proofs" WHERE "proofs"."id" = ?  [["id", 3]]

    def set_proof
      @proof = Proof.find(params[:id])
---
SELECT  "proofs".* FROM "proofs" WHERE "proofs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]